#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <Windows.h>
#include <conio.h>
#include "function.h"
#include "struct.h"
#include "util.h"

// 가입하기
void SignUP() {
	LOGIN LOG = { 0, };
	LOGIN LOG2 = { 0, };
	char id[20] = { 0, };
	system("cls");
	printf("======================================================================================================\n");
	printf("                ___   _  _______    _______  ___  __    _  _______  __   __  _______\n");
	printf("               |   | | ||  _    |  |       ||   ||  |  | ||       ||  |_|  ||   _   |\n");
	printf("               |   |_| || |_|   |  |       ||   ||   |_| ||    ___||       ||  |_|  |\n");
	printf("               |      _||       |  |       ||   ||       ||   |___ |       ||       |\n");
	printf("               |     |_ |  _   |   |      _||   ||  _    ||    ___||       ||       |\n");
	printf("               |    _  || |_|   |  |     |_ |   || | |   ||   |___ | ||_|| ||   _   |\n");
	printf("               |___| |_||_______|  |_______||___||_|  |__||_______||_|   |_||__| |__|\n");
	printf("\n");
	printf("======================================================================================================\n");
	printf("\n\n");
	printf("                                             회원 가입\n");
	printf("\n\n");
	printf("                                 ┌──────────────────────────────┐\n");
	printf("                                 │ ID:                          │\n");
	printf("                                 └──────────────────────────────┘\n");
	printf("                                 ┌──────────────────────────────┐\n");
	printf("                                 │ 비밀번호:                    │\n");
	printf("                                 └──────────────────────────────┘\n");
	printf("                                 ┌──────────────────────────────┐\n");
	printf("                                 │ E-Mail:                      │\n");
	printf("                                 └──────────────────────────────┘\n");
	printf("                                 ┌──────────────────────────────┐\n");
	printf("                                 │ 전화번호:                    │\n");
	printf("                                 └──────────────────────────────┘\n");
	gotoxy(39, 16);
	scanf("%s", id);
	FILE* fp = fopen("D:/save_ID.txt", "rb");
	if (fp != NULL) {
		while (fread(&LOG, sizeof(LOG), 1, fp) == 1) {
			while (strcmp(id, LOG.ID) == 0) {
				gotoxy(39, 16); printf("이미 존재하는 ID입니다.");
				Sleep(1000);
				gotoxy(39, 16); printf("                         ");
				gotoxy(39, 16); scanf("%s", id);
			}
		}
	}
	else if (fp == NULL) {
		fp = fopen("D:/save_ID.txt", "wb");
	}
	fclose(fp);
	
	strcpy(&LOG2.ID, &id);
	gotoxy(45, 19);
	scanf(" %s", &LOG2.PASSWORD);
	gotoxy(43, 22);
	scanf(" %s", &LOG2.EMAIL);
	gotoxy(45, 25);
	scanf(" %s", &LOG2.PHONE);

	SAVE_ID(LOG2);
	printf("\n\n\n");
	printf("                                    회원가입이 완료되었습니다.\n");
	printf("                                   아무 키나 누르면 돌아갑니다.\n");
	_getch();
}

// 로그인 하기
void Login(char* id, char* passwd) {
	int login_chk = 0;
	while (1) {
		system("cls");
		printf("======================================================================================================\n");
		printf("                ___   _  _______    _______  ___  __    _  _______  __   __  _______\n");
		printf("               |   | | ||  _    |  |       ||   ||  |  | ||       ||  |_|  ||   _   |\n");
		printf("               |   |_| || |_|   |  |       ||   ||   |_| ||    ___||       ||  |_|  |\n");
		printf("               |      _||       |  |       ||   ||       ||   |___ |       ||       |\n");
		printf("               |     |_ |  _   |   |      _||   ||  _    ||    ___||       ||       |\n");
		printf("               |    _  || |_|   |  |     |_ |   || | |   ||   |___ | ||_|| ||   _   |\n");
		printf("               |___| |_||_______|  |_______||___||_|  |__||_______||_|   |_||__| |__|\n");
		printf("\n");
		printf("======================================================================================================\n");
		printf("\n\n");
		printf("                                    ┌─────────────────────────┐\n");
		printf("                                    │        1. 로그인        │\n");
		printf("                                    └─────────────────────────┘\n");
		printf("                                    ┌─────────────────────────┐\n");
		printf("                                    │       2. 회원가입       │\n");
		printf("                                    └─────────────────────────┘\n");
		printf("                                    ┌─────────────────────────┐\n");
		printf("                                    │      3. 비회원 예매     │\n");
		printf("                                    └─────────────────────────┘\n");
		printf("\n\n");
		printf("                                                                            기능 선택: ");
		int logNum = 0;
		scanf("%d", &logNum);
		while (1) {
			if (logNum == 1) {
				system("cls");
				printf("======================================================================================================\n");
				printf("                ___   _  _______    _______  ___  __    _  _______  __   __  _______\n");
				printf("               |   | | ||  _    |  |       ||   ||  |  | ||       ||  |_|  ||   _   |\n");
				printf("               |   |_| || |_|   |  |       ||   ||   |_| ||    ___||       ||  |_|  |\n");
				printf("               |      _||       |  |       ||   ||       ||   |___ |       ||       |\n");
				printf("               |     |_ |  _   |   |      _||   ||  _    ||    ___||       ||       |\n");
				printf("               |    _  || |_|   |  |     |_ |   || | |   ||   |___ | ||_|| ||   _   |\n");
				printf("               |___| |_||_______|  |_______||___||_|  |__||_______||_|   |_||__| |__|\n");
				printf("\n");
				printf("======================================================================================================\n");
				printf("\n\n");
				printf("                                              로그인\n");
				printf("\n\n");
				printf("                                 ┌──────────────────────────────┐\n");
				printf("                                 │ ID:                          │\n");
				printf("                                 └──────────────────────────────┘\n");
				printf("                                 ┌──────────────────────────────┐\n");
				printf("                                 │ 비밀번호:                    │\n");
				printf("                                 └──────────────────────────────┘\n");
				gotoxy(39, 16);
				scanf("%s", id);
				gotoxy(45, 19);
				scanf("%s", passwd);

				login_chk = check_ID(id, passwd);
				if (login_chk == 1) {
					// 로그인 성공 - 로그인 이후 창
					printf("\n\n\n");
					printf("                                       로그인에 성공했습니다.\n");
					printf("                                계속 진행하시려면 아무 키나 누르세요.\n");
					_getch();
					return;
				}
				else {
					// 로그인 실패 - 처음 화면으로
					printf("\n\n\n");
					printf("                            존재하지 않는 ID이거나, 비밀번호가 틀렸습니다.\n");
					printf("                                     확인 후 다시 시도해주세요.\n");
					printf("                                    아무 키나 누르면 돌아갑니다.\n");
					_getch();
					break;
				}
			}
			else if (logNum == 2)
			{
				// 회원 가입
				SignUP();
				break;
			}
			else if (logNum == 3) {
				strcpy(id, "");
				return;
			}
			else {
				gotoxy(0, 23);
				printf("                                                                            기능 선택:     ");
				gotoxy(0, 23);
				printf("                                                                            기능 선택: ");
				rewind(stdin);
				scanf("%d", &logNum);
			}
		}
	}
}